"""Дан список. Создать новый список, сдвинутый на 1 элемент влево
Пример: 1 2 3 4 5 -> 2 3 4 5 1"""
l1=list(range(6))
i=0
while i<1:
    l1=l1[1:]+[0]
    print(l1)
    i+=1
    
l1=list(range(6))
i=0
for i in l1:
    l1 = l1[1:] + [0]
    print(l1)
    break