"""Дан список целых чисел. Создать новый список, каждый элемент которого равен исходному элементу
умноженному на -2"""
l1 = list(range(5))
#or i in l1:
#   i = i*(-2)
#   print(i, end=" ")


while True:
    i = i * (-2)
    print(i, end=" ")
    break